#include <stdio.h>

unsigned int count_steps(unsigned int x, unsigned int y) {
    unsigned int count = 0; // Лічильник кроків, ініціалізований нулем
    
    while (x != y) { // Поки x не дорівнює y, виконуємо цикл
        if (x < y) { // Якщо x менше y
            if ((y - x) == 1 || (y - x) % 2 == 0) {
                // Якщо різниця між x та y є 1 або парним числом, збільшуємо x на 1
                x++;
            } else {
                // Якщо різниця між x та y є непарним числом, збільшуємо x на 2
                x += 2;
            }
        } else { // Якщо x більше y
            if ((x - y) == 1 || (x - y) % 2 == 0) {
                // Якщо різниця між x та y є 1 або парним числом, зменшуємо x на 1
                x--;
            } else {
                // Якщо різниця між x та y є непарним числом, зменшуємо x на 2
                x -= 2;
            }
        }
        
        count++; // Збільшуємо лічильник кроків на 1
    }
    
    return count; // Повертаємо кількість кроків
}

int main() {
    unsigned int x, y;
    
    printf("Введіть значення x та y: ");
    scanf("%u %u", &x, &y); // Зчитуємо значення x та y з консолі
    
    unsigned int steps = count_steps(x, y); // Обчислюємо мінімальну кількість кроків
    
    printf("Мінімальна кількість кроків: %u\n", steps); // Виводимо результат
    
    return 0;
}
