#include <stdio.h>

int countSequences(int n) {
    int dp[n+1]; // Масив для збереження проміжних результатів
    dp[0] = 1; // Відомі значення для довжини 0
    dp[1] = 2; // Відомі значення для довжини 1
    dp[2] = 4; // Відомі значення для довжини 2
    
    for (int i = 3; i <= n; i++) {
        
        dp[i] = (dp[i-1] + dp[i-2] + dp[i-3]) % 12345; // Обчислення кількості послідовностей довжиною i
    }
    
    return dp[n]; // Повертаємо кількість шуканих послідовностей
}

int main() {
    int n;
    printf("Введіть довжину послідовності n: ");
    scanf("%d", &n);
    
    int result = countSequences(n); // Обчислюємо кількість послідовностей
    printf("Кількість шуканих послідовностей: %d\n", result);
    
    return 0;
}
