#include <stdio.h> // Підключення бібліотеки

// Функція для знаходження НСД двох чисел
int findGCD(int a, int b) {
    while (b != 0) { // Поки b не дорівнює 0
        int temp = b; // Зберігаємо значення b в змінну temp
        b = a % b; // Присвоюємо b залишок від ділення a на b
        a = temp; // Присвоюємо a попереднє значення b (збережене в temp)
    }
    return a; // Повертаємо a, як результат (НСД)
}

// Функція для знаходження НСК двох чисел
int findLCM(int a, int b) {
    int gcd = findGCD(a, b); // Знаходимо НСД чисел a і b
    return (a / gcd) * b; // Обчислюємо НСК і повертаємо його
}

// Функція для знаходження НСК декількох чисел
int findLCMOfArray(int arr[], int n) {
    int lcm = arr[0]; // Ініціалізуємо НСК значенням першого елемента масиву

    // Проходимо по решті елементів масиву
    for (int i = 1; i < n; i++) {
        lcm = findLCM(lcm, arr[i]); // Знаходимо НСК між поточним НСК (lcm) і наступним елементом масиву
    }

    return lcm; // Повертаємо НСК декількох чисел
}

int main() {
    int n;
    printf("Введіть кількість чисел: "); // Виведення тексту
    scanf("%d", &n); // Введення кількості чисел

    int numbers[20]; // Оголошення масиву
    printf("Введіть числа: "); // Виведення тексту
    for (int i = 0; i < n; i++) { // Початок циклу for
        scanf("%d", &numbers[i]); // Введення чисел і збереження їх у масиві numbers
    }

    int lcm = findLCMOfArray(numbers, n); // Знаходження НСК декількох чисел
    printf("Найменше спільне кратне: %d\n", lcm); // Виведення результату НСК

    return 0;
}
